Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.ProblemWithPowerLoadWarn Property
 [Room]'s power load is too high. This may be caused by an incorrect density value and must be corrected before this space can be included in the load calculations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ProblemWithPowerLoadWarn { get; }
Visual Basic
Public Shared ReadOnly Property ProblemWithPowerLoadWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ProblemWithPowerLoadWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace